# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-Rk1NYiwVxPTuxV2s

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
tfe_project.default: Refreshing state... [id=prj-C7gU6BPKhfZ8WHak]
data.tfe_workspace.default: Refreshing...
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-jotVYSRv58PvMnX7]
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-3saeTSfth8ceA3f4]
module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-DFQhZrpRudi1YxmE]
module.customer.tfe_workspace.customer: Refreshing state... [id=ws-AbQ1UdiNbbr6LsjT]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-4A6AuKxyDYFDDHAD]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-zaNMyLE6UBB5jXkk]
data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
data.tfe_variables.default: Refreshing...
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-LQsh3YL8Ya2X9Gmh]
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-ZL9dNSWq5koZMEdK]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-4HiP4pWTx2vmuETG]
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-gEEoxv638c4yiW4E]
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-wwNHEHTzsWGo9wF7]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-aBFvWcLhiaeCY2dL]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-Sf6PotsjU3w4q9LJ]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-ii2KRcur1EZvb1R1]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-4RzdzxYxvNLjNoBq]
module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-TYLKyFyCf8QCcFRB]
module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-UWLYZmyrEadWXHh6]
module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-Zkgyr46UPaRXr7sR]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-NAprvbdaTUoUr5AT]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-imyodC81fxTHWc3Z]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-dbF8jaNMsf4HCgdY]
module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-ibaHupv7Pr5jBGRV]
module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-2vgVfpAfxkN9HUBt]
module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-FVC2cesH2CYwkWg3]
data.tfe_variables.default: Refresh complete after 1s [id=variables/ws-wwXQa69M62VYdb4M]
module.organization.tfe_workspace.organization: Drift detected (update)
module.organization.tfe_workspace.organization_api: Drift detected (update)
module.customer.tfe_workspace.customer: Drift detected (update)
module.customer.tfe_workspace.customer_api: Drift detected (update)
module.identity.tfe_workspace.identity: Drift detected (update)
module.identity.tfe_workspace.identity_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-C7gU6BPKhfZ8WHak"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "shared",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/staging"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*